{
    "0": "This demo shows how to highlight bits of text within a textarea. Alright, that's a lie. You can't actually render markup inside a textarea. However, you can fake it by carefully positioning a div behind the textarea and adding your highlight markup there. JavaScript takes care of syncing the content and scroll position from the textarea to the div, so everything lines up nicely. Hit the toggle button to peek behind the curtain. And feel free to edit this text. All capitalized words will be highlighted. This demo shows how to highlight bits of text within a textarea. Alright, that's a lie. You can't actually render markup inside a textarea. However, you can fake it by carefully positioning a div behind the textarea and adding your highlight markup there. JavaScript takes care of syncing the content and scroll position from the textarea to the div, so everything lines up nicely. Hit the toggle button to peek behind the curtain. And feel free to edit this text. All capitalized words will be highlighted.",
    "1": "Today, historians relate that, as a general rule, buying and selling securities was very much unorganized before the year 1792. Every person who owned a security faced the problem of finding interested buyers who might consider the purchase of a debt-free investment. This meant most people were somewhat slow in investing in stocks and bonds because these securities could not readily be converted into money. We have been told that an interesting number of traders and merchants agreed to try to do something to help correct the situation. At this first crucial meeting, they decided that it was a good idea to visit regularly on a daily basis to buy and sell securities. The group of leaders, whose meeting place was under an old, tall cottonwood tree, found the needed time to plot the financial future of our nation. We know from reading the old records that the original team who met together long ago in May became the very first members of the New York Stock Exchange. The New York Stock Exchange is still operating. Other stock exchanges conduct business in many countries around the world. Thousands and thousands of stocks and bonds are bought and sold each day.",
    "2": "Frank Edward McGurrin, a court stenographer from Salt Lake City, Utah who taught typing classes, reportedly invented touch typing in 1888. On a standard keyboard for English speakers the home row keys are: 'ASDF' for the left hand and 'JKL;' for the right hand. The keyboard is called a QWERTY keyboard because these are the first six letters on the keyboard. Most modern computer keyboards have a raised dot or bar on the home keys for the index fingers to help touch typists maintain and rediscover the correct position on the keyboard quickly with no need to look at the keys. More recently, the ability to touch type on touchscreen phones has been made possible with the use of specialized virtual keyboard software for touch typing. Frank Edward McGurrin, a court stenographer from Salt Lake City, Utah who taught typing classes, reportedly invented touch typing in 1888. On a standard keyboard for English speakers the home row keys are: 'ASDF' for the left hand and 'JKL;' for the right hand. The keyboard is called a QWERTY keyboard because these are the first six letters on the keyboard. Most modern computer keyboards have a raised dot or bar on the home keys for the index fingers to help touch typists maintain and rediscover the correct position on the keyboard quickly with no need to look at the keys. More recently, the ability to touch type on touchscreen phones has been made possible with the use of specialized virtual keyboard software for touch typing.",
    "3": "The history of dentistry is almost as ancient as the history of humanity and civilization with the earliest evidence dating from 7000 BC. Remains from the early Harappan periods of the Indus Valley Civilization (c. 3300 BC) show evidence of teeth having been drilled dating back 9,000 years. It is thought that dental surgery was the first specialization from medicine. The history of dentistry is almost as ancient as the history of humanity and civilization with the earliest evidence dating from 7000 BC. Remains from the early Harappan periods of the Indus Valley Civilization (c. 3300 BC) show evidence of teeth having been drilled dating back 9,000 years. It is thought that dental surgery was the first specialization from medicine. The history of dentistry is almost as ancient as the history of humanity and civilization with the earliest evidence dating from 7000 BC. Remains from the early Harappan periods of the Indus Valley Civilization (c. 3300 BC) show evidence of teeth having been drilled dating back 9,000 years. It is thought that dental surgery was the first specialization from medicine.",
    "4": "Drugs are classified in various ways. One of the key divisions is by level of control, which distinguishes prescription drugs (those that a pharmacist dispenses only on the order of a physician, physician assistant, or qualified nurse) from over-the-counter drugs (those that consumers can order for themselves). Another key distinction is between traditional small-molecule drugs, usually derived from chemical synthesis, and biopharmaceuticals, which include recombinant proteins, vaccines, blood products used therapeutically (such as IVIG), gene therapy, monoclonal antibodies and cell therapy (for instance, stem-cell therapies). Other ways to classify medicines are by mode of action, route of administration, biological system affected, or therapeutic effects. An elaborate and widely used classification system is the Anatomical Therapeutic Chemical Classification System (ATC system). The World Health Organization keeps a list of essential medicines. Drugs are classified in various ways. One of the key divisions is by level of control, which distinguishes prescription drugs (those that a pharmacist dispenses only on the order of a physician, physician assistant, or qualified nurse) from over-the-counter drugs (those that consumers can order for themselves). Another key distinction is between traditional small-molecule drugs, usually derived from chemical synthesis, and biopharmaceuticals, which include recombinant proteins, vaccines, blood products used therapeutically (such as IVIG), gene therapy, monoclonal antibodies and cell therapy (for instance, stem-cell therapies). Other ways to classify medicines are by mode of action, route of administration, biological system affected, or therapeutic effects. An elaborate and widely used classification system is the Anatomical Therapeutic Chemical Classification System (ATC system). The World Health Organization keeps a list of essential medicines.",
    "5": "C# is a multi-paradigm programming language encompassing strong typing, imperative, declarative, functional, generic, object-oriented (class-based), and component-oriented programming disciplines. C# is one of the programming languages designed for the Common Language Infrastructure designed by Microsoft. The language is intended to be a simple, modern, general-purpose, object-oriented programming language. The language, and implementations thereof, should provide support for software engineering principles such as strong type checking, array bounds checking, detection of attempts to use uninitialized variables, and automatic garbage collection. Software robustness, durability, and programmer productivity are important. The language is intended for use in developing software components suitable for deployment in distributed environments. Portability is very important for source code and programmers, especially those already familiar with C and C++. Support for internationalization is very important. C# is intended to be suitable for writing applications for both hosted and embedded systems, ranging from the very large that use sophisticated operating systems, down to the very small having dedicated functions. Although C# applications are intended to be economical with regard to memory and processing power requirements, the language was not intended to compete directly on performance and size with C or assembly language.",
    "6": "Investment analysis (or capital budgeting) is concerned with the setting of criteria about which value-adding projects should receive investment funding, and whether to finance that investment with equity or debt capital. Working capital management is the management of the company's monetary funds that deal with the short-term operating balance of current assets and current liabilities; the focus here is on managing cash, inventories, and short-term borrowing and lending (such as the terms on credit extended to customers). Investment analysis (or capital budgeting) is concerned with the setting of criteria about which value-adding projects should receive investment funding, and whether to finance that investment with equity or debt capital. Working capital management is the management of the company's monetary funds that deal with the short-term operating balance of current assets and current liabilities; the focus here is on managing cash, inventories, and short-term borrowing and lending (such as the terms on credit extended to customers).",
    "7": "The Associated Press Stylebook and Briefing on Media Law, usually called the AP Stylebook, is an English grammar style and usage guide created by American journalists working for or connected with the Associated Press over the last century to standardize mass communications. Although it is sold as a guide for reporters, it has become the leading reference for most forms of public-facing corporate communication over the last half-century. The Stylebook offers a basic reference to grammar, punctuation and principles of reporting, including many definitions and rules for usage as well as styles for capitalization, abbreviation, spelling and numerals. The first publicly available edition of the book was published in 1953 and was updated biennially over the next 20 years. While nearly two million copies of the AP Stylebook have been distributed since 1977, today the AP Stylebook is developing an online presence with profiles on social media platforms like Twitter (@APStylebook) and Facebook, and is available through an online subscription model as well as an iOS mobile app. (Wikipedia)",
    "8": "India strongly criticized an 'unresponsive' Security Council on Wednesday for being indecisive on sanctioning leaders of organizations it itself designates as terrorist entities after China extended its 'technical hold' on India's bod for a UN ban against JeM chief Massod Azhar. India's Permanent Representative to the UN Ambassador Syed Akbaruddin told the UN General Assembly that the 15-nations Security Council, the 'principal organ' tasked with the  maintenance of peace and security, has in a variety of  ways become 'unresponsive' to the needs of our time and ineffective to meeting the challenges it is confronted with. India strongly criticized an 'unresponsive' Security Council on Wednesday for being indecisive on sanctioning leaders of organizations it itself designates as terrorist entities after China extended its 'technical hold' on India's bod for a UN ban against JeM chief Massod Azhar. India's Permanent Representative to the UN Ambassador Syed Akbaruddin told the UN General Assembly that the 15-nations Security Council, the 'principal organ' tasked with the  maintenance of peace and security, has in a variety of  ways become 'unresponsive' to the needs of our time and ineffective to meeting the challenges it is confronted with.",
    "9": "Two friends were walking through the desert. At one stage in their journey, they had an argument and one friend slapped the other one in the face. The one who got slapped was hurt, but without saying anything he wrote in the sand. Today my best friend slapped me in the face. They kept on walking until they found an oasis, where they decided to have a wash. The one who had been slapped got stuck in a mire and started drowning, but his friend saved him. After he had recovered from his shock, he wrote on a stone. Today my best friend saved my life. Two friends were walking through the desert. At one stage in their journey, they had an argument and one friend slapped the other one in the face. The one who got slapped was hurt, but without saying anything he wrote in the sand. Today my best friend slapped me in the face. They kept on walking until they found an oasis, where they decided to have a wash. The one who had been slapped got stuck in a mire and started drowning, but his friend saved him. After he had recovered from his shock, he wrote on a stone. Today my best friend saved my life."
} 